[{"product_id":"B000001","product_name":"Flying Eagle Skate Carrier Movement Backpack","image":"http://timrlai.com/bts530/FE-Large-Backpack-Movement.jpg","price":59.97,"stock_amount":null,"sku":"FE-A-MOVE","brand":"Flying Eagle","intro":"The Flying Eagle Movemement Backpacks are an excellent choice for carrying your skates around, commuting, school, and everyday use. External skate carriers zip away to be hidden when not in use. The back panel has an embroidered Flying Eagle logo and zippers on both sides that result in two separate storage pockets. Padded shoulder straps, laptop storage and simple elegance have made this bag a clear favourite.","description":"Colours: Blue, Purple, and Grey\rSizes : Grey – Large, Blueand Purple – Medium","stock_status":"In Stock","rating":5},{"product_id":"F000001","product_name":"Kizer Soulframe 68 Frames","image":"http://timrlai.com/bts530/800050_36751_Soulframe_68_SZ4.jpeg","price":225.97,"stock_amount":"6","sku":"800050","brand":"Kizer","intro":"After the success of the USD Aeon skate, we took a close look at its design in the development of the new Kizer Soulframe 68. We wanted to lower the center of gravity whilst increasing the direct feeling of grinding. It is completely made out of aluminum for maximum energy transfer, faster grinds, and designed specifically for the high-speed park- or bowl skating and coping grinds. Like the Aeon it is a non-UFS unibody soul plate with an integrated frame, to achieve the lowest center of gravity and widest split for flat setups, making it lighter and stronger whilst using fewer parts.Plate and frame are made out of 6061 aircraft aluminum, CNC machined to perfection, and coming with the new Element II aluminum H-block. The Soulframe has predrilled and recessed mounting holes which are compatible fit most USD skates and also Salomons. The 68 version is designed specifically for 68mm and 64mm flat setups, making the Soulframe 68 one of the fastest and most stable flat setups available in modern aggressive skating.","description":"Sold in pairs.\rWheels Setup : 4x65mm with UFS mounting or 4x68mm with soulframe mounting\rMount : UFS\rSizes : XL = 276mm\rMaterial : AL 6061 aircraft\rIncluded Accessories : AL spacer, mounting screws, does not incl.mounting antirivets","stock_status":"In Stock","rating":null},{"product_id":"F000002","product_name":"Endless Blading 80/84/100 Trinity Frame","image":"http://timrlai.com/bts530/Endless-84-Trinity.jpg","price":208.97,"stock_amount":null,"sku":"EBR-FRM-80-TR","brand":"Endless Blading","intro":"The Endless 84 Trinity Frame is a precision machined, multi-setup frame designed specifically to elevate Powerslide TRINITY skates to the highest level of aesthetics and performance. The result is an even more enjoyable skate. This frame is the long-awaited TRINITY version of the original Endless 80 Frame and offers the same acclaimed experience skaters across the world have been buzzing about since Endless launched. We are proud to be the very first brand to create freeskate frames for Powerslide TRINITY urban and recreational skates.","description":"One frameset includes: 2 frames and 8 axles\rSpecs:\rMultiple setups : 4×80, 4×84, 3×100\rBalanced Rocker for 4 - wheel setups\rFlat configuration for 3×100 setup(bullet profile wheels only recommended)\rRecommended for all skill levels\rMounting : TRINITY 3 - point\rWheelbase : 255 mm\rBrake compatibility :\r4×80 : Powerslide Urban Brake Size S(908058 / 1)\r4×84 : Powerslide Urban Brake Size M(908058 / 2)\r3×100 : Powerslide Urban Brake Size L(908058 / 3)\rCNC - machined from 6061 - T6 aluminum\rWeight = 256 grams, without spacers and axles","stock_status":"In Stock","rating":null},{"product_id":"S000001","product_name":"CITYBUG ES315D e-Scooter","image":"http://timrlai.com/bts530/ES315D-0.jpg","price":398.79,"stock_amount":"29","sku":"ES315D","brand":"CITYBUG","intro":"CITYBUG ES315D is the most elegant with aerodynamic and modern design eScooter. Equipped with durable and quiet brushless direct current hub motor. It is the perfect way to get from point A to point B, to commute, or just to have a fun ride! It is easy to fold and will fit any size car trunk.This electrical scooter features a quick react acceleration with max speed up to 25km/h and an extremely intuitive thumb control design with just one press then you are good to go. It has 3 riding modes for any skill level.","description":"* The headlight(as on the photos) is not included\r* *Due to the current regulations, this product can be shipped only Groundand only within North America!\rTechnical details :\rWeight: 13.2 kg\rMotor : 250W / 36V\rBattery : 36V 5.6Ah\rDriving distance : Approx. 20km\rMax speed : 25km / hr\rBrake : e - brake with lever control & fender brake\rWheels : 8” solid tires\rCharging time : ~2.8hr","stock_status":null,"rating":null},{"product_id":"SS00001","product_name":"Powerslide Next Grey Trinity 80","image":"http://timrlai.com/bts530/PS-Next-Grey-80.jpg","price":249.97,"stock_amount":null,"sku":"908371","brand":"Powerslide","intro":"With the Powerslide Next Grey 80 you will be ready for action. The city is full of surprises but The Powerslide NEXT Grey 80 won’t let you down in any situation. These skates are featuring the patented TRINITY mounting system known for amazing power transfer and reactivity, additional control, and improved balance as well as less roll vibration that helps to reduce muscle fatigue.\rIt’s the third generation of NEXT skates coming with heat moldable MYFIT Recall dual fit liners, which provide premium comfort with the extra layer of memory foam padding.This urban 4 - wheel inline skate is made for both, hair raising actionand relaxed cruising.Elite casted aluminum frames combined with fastand grippy Powerslide Spinner 80mm / 88A wheels and Wicked ABEC 9 freespin bearings.The NEXT Grey 80 is a stunning light grey and purple freeskate for skaters who demand only but the best quality.","description":"Perfect for Power Skating, Urban, and Fitness\rShell: Polypropylene, Glass - fiber reinforced plastic(GFRP) – GFK\rClosures : Upper Strap, Middle micro - adjustable ratchet buckle, laces\rLiners : MYFIT Recall Liner, Heat moldable, Dual Fit\rFrame : Powerslide Elite TRINITY 243mm 3x110mm\rFrame Mount : Trinity with Lower Center Of Gravity\rWheels : Powerslide Spinner 110mm / 88A Black / Turquoise\rBearings : Wicked ABEC9\rBrake : not Included.Optional HABS brake\rWeight : 1820g(size 41U)","stock_status":"In Stock","rating":null},{"product_id":"SS00002","product_name":"FR Skates FR2 310 Black Freeskate","image":"http://timrlai.com/bts530/FR-Skates-FR2-310.jpg","price":298.97,"stock_amount":null,"sku":"FRSK-FR2310-BK","brand":"FR Skates","intro":"The FR Skates FR2 310 is the perfect skate for FReeride. Thanks to the integrated plates, you will gain in stability and precision. The FR2 is a great skate to improve your skills in all skating styles.","description":"Perfect for Urban, Freeskating, and City Skating. https://youtu.be/s7UqHXYIExo\rShell: Plastic Shell, 4 Position Plastic Cuff, 7 - hole frame mounting plate\rClosures : Metal Buckle Top Lock Strap, Middle Adjustable Strap, and Laces\rCuff Mounting : Cuff buttons adjustable in 4 positions\rLiners : Removable with removable shock absorbers\rFrame : FR R2 3×110 246mm aluminum\rFrame Mount : 165mm / 180mm / 195mm\rWheels : FR Downtown White 110mm / 85A\rBearings : Twincam MW7 Titalium Freeride\rBrake : Not Included\rDesigned and assembled in France\rSizes : 36 - 47 EU","stock_status":"In Stock","rating":null},{"product_id":"SS00003","product_name":"Stanley Mini Tank Junior Inline Freeride Skates Size Adjustable","image":"http://timrlai.com/bts530/Stanley-Mini-Tank-Freeride-Skates-.jpeg","price":89.97,"stock_amount":null,"sku":"ST-MINI-TANK","brand":"Stanley","intro":"Mini Tank Freeride Skates are freeride and slalom skates designed for kids based on the Tank Skates. Kids can use it to free skating,urban skating and freestyle slalom.\rMini Tank Freeride is not adjusted by the telescopic boot.The Stanley designers have higher standards for the stability of Mini Tank, so it is used a 3 - in - 1 insole.There are three 3D insoles in the boots.When your feel the skates pinch your feet, you can take out a pair of insoles so that the space inside of boots will become larger.This not only increases the space inside, but also ensures a higher stability of the skates.\rThe Mini Tank Skates’s boot is a solid hardboot that is sufficient to protect the kids’s feet.The height of the cuff is reduced to suit the kidsand the ankle is more agile.The Mini Tank is equipped with the rockered frameand two milimetric buckle kits.Your kids can easily control the skatesand do a lot of freestyle tricks.","description":"Perfect for: Fitness and Freeride Skating\rTechnical details :\rPadding: Neoprene material for maximum comfort\rClosure : Middle Flap Adjustable Strap, and Laces\rFrames : Stanley Sport 4 x 76mm\rWheels : Stanley 76mm 85A\rBearings : Stanley ABEC - 9\rHeel brake is not included\rSizes : EU 37 - 39 EU Size adjustable\rDesigned and made in China","stock_status":"In Stock","rating":null},{"product_id":"WB0001","product_name":"Rossignol X-8 Men’s Race Classic Nordic Ski Boots Black/Red","image":"http://timrlai.com/bts530/rik1260_x_8_classic_rgb72dpi_01.jpeg","price":194.97,"stock_amount":null,"sku":"RIK1260","brand":"Rossignol","intro":"Train or race. The X8 Classic ski boot is designed for fitness oriented skiers and junior racers. Its race inspired design shares technology with our athlete proven X-ium series to deliver increased precision and power transfer with an accessible flex for fitness and recreational use. The classic specific sole delivers a natural foot roll for an efficient kick, while the locked-in fit and thermo-moldable design provide a precise, enveloped fit to deliver ultimate comfort and control.\rPrecise Boot Flex, Fit\rDual Core Technology allows targeted boot stiffness for the most responsive feel without a weight penalty\rSki Control, Walkability\rThe Sport Sole features Tech Grip for comfortable walkingand central insert cleats for maximum precisionand control on the ski\rBreathable Warmth\rWINTHERM® offers a breathable micro - perforated membrane that reflects heat back towards its source for incredible temperature regulation, comfortand warmth","description":"Please note: due to the brand rules this product does not qualify for a price match nor we are able to offer the PSP Rewards.\rWeight: 930 g / pair(size 42)\rSizes : 36 – 49EU\rSole : Sport\rLining : Polyester + Win Therm active membrane\rConstruction Upper Cuff : Performance PVC\rHeel : 3D plastic reinforcement Dual Core","stock_status":"In Stock","rating":null}]